testCases/ductFlowAR1Reb3500/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          turbulenceProperties;
}

simulationType  RAS;

RAS
{
    RASModel        kOmegaSSTPDA2DEARSM; 

    //Optional Coefficients
    PDA2DEARSM          1;          //0:off | 1:ModelI | 2:ModelII

    turbulence      on;
    printCoeffs     on;
}



// ************************************************************************* //
